import sys
from sys import exit

act = ['Y', 'y']

def Rider():
	bonus = 0
	act_1 = input('\nВжух-вжух! Який чудовий жаркий липневий день. \nВ маршрутцi вже майже немає сидячих мiсць. \nМоже ще покурити перед поїздкою? \nЛюди ж нiкуди не спiшать. y/n > ')
	if act_1 in act:
		print('\nМолодець, ти справжнiй мужик! Лови 10 грн.')
		bonus = bonus + 10
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nНе позорся! Йди хоча б сємки погризи')
		print('\nТвiй баланс ', bonus, ' гривень.')

	print ('------------------------------------------------------')
		
	act_2 = input('\nМаршрутка вже повна - можна рушати. \nОоо, ще хтось добiгає! Притиснути дверима? y/n > ')
	if act_2 in act:
		print ('\nТак як батько вчив! Ще 5 грн. в кишеню.')
		bonus = bonus + 5
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nОтакої, оце ти уважний')
		print('\nТвiй баланс ', bonus, ' гривень.')

	print ('------------------------------------------------------')		
		
	act_3 = input('\nПiд\'їжджаємо до зупинки, але попереду трамвай. Биканути трамваю? y/n >')
	if act_3 in act:
		print ('\nТрамвай не промах - биканув тобi. \nТи пропустив зупинку i втратв грошi. Мiнус 4 грн з гаманця')
		bonus = bonus - 4
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nТрамвай - це святе. Зате на зупинцi залишилось багато пасажирiв. \nПлюс 10 грн. в гаманець')
		bonus = bonus + 10
		print('\nТвiй баланс ', bonus, ' гривень.')
	
	print ('------------------------------------------------------')
	
	act_4 = input('\nХтось зайшов в заднi дверi i не заплатив за проїзд. \nКричати "Передаємо за проїзд!!!? y/n >')
	if act_4 in act:
		print ('\nЗззадi заходили! Передаємо за проїзд, бо дальше не поїду! \nЮххуу, передали аж 4 грн.')
		bonus = bonus + 4
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nПасажири зрозумiли, що водiй лох i нiхто не передав за проїзд. Мiнус 8 грн.')
		bonus = bonus - 8
		print('\nТвiй баланс ', bonus, ' гривень.')

	print ('------------------------------------------------------')	
		
	act_5 = input('\nВ салон пробрався пiльговик. Нахамити йому? y/n >')
	if act_5 in act:
		print ('\nСкiльки можна їздити! Менi за вас грошей не платять! \nВ результатi получив палицею по чолi. Мiнус 5 грн на пластир')
		bonus = bonus - 5
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nБабця подякувала i дала 2 грн.')
		bonus = bonus + 2
		print('\nТвiй баланс ', bonus, ' гривень.')
		
	print ('------------------------------------------------------')
	
	act_6 = input('\nТи тиснеш на газ по широкому проспектi. \ni тут раптом тебе доганяє маршрутка-конкурент. \nПозмагаєшся за право першим приїхати на зупинку? y/n >')
	if act_6 in act:
		print ('\nЗа кущем сидiли полiсмени! Ти попався, чоловiче. \nМiнус 15 грн вилiтають, як пташки з клiтки.')
		bonus = bonus - 15
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nЗа кущем сидiли полiсмени! Невдаха конкурент попав на грошi, а ти красунчик - \nзабрав всiх його пасажирiв на зупинцi. \nПлюс 20 грн в кишеню.')
		bonus = bonus + 20
		print('\nТвiй баланс ', bonus, ' гривень.')
		
	print ('------------------------------------------------------')
	
	if bonus > 0:
		print ('\nВечiр добiгає кiнця, можна з\'їхати з останнiх рейсiв. \nНа базi Васильович вже чекає з пивом. \nЗа день ти заробив ', bonus, 'гривень. Молодець!')
		act_7 = input('\nЗiграти iншим героєм? y/n >')
		if act_7 in act:
			print ('------------------------------------------------------')
			player = input('\nВибрати гравця: водiй - 1, пасажир - 2, бабця - 3 > ')
			if player == '1':
				Rider()
			elif player == '2':
				Passenger()
			elif player == '3':
				print('Очiкуй незабаром')
				exit()
	else:
		print('\nВечiр добiгає кiнця, можна з\'їхати з останнiх рейсiв. \nНа базi Васильович вже чекає з пивом. \nЗа день ти заробив ', bonus, 'гривень.') 
		act_8 = input('\nСпробувати заробити бiльше? y/n >')
		if act_8 in act:
			print ('------------------------------------------------------')
			Rider()
		else:
			print ('------------------------------------------------------')
			player = input('\nВибрати гравця: водiй - 1, пасажир - 2, бабця - 3 > ')
			if player == '1':
				Rider()
			elif player == '2':
				Passenger()
			elif player == '3':
				print('Очiкуй незабаром')
				exit()
			

def Passenger():
	bonus = 0
	act_1 = input('\nВжух-вжух! Який чудовий жаркий липневий день. \nВ маршрутцi вже майже немає сидячих мiсць. \nСiдати чи зачекати на наступну?. y/n > ')
	if act_1 in act:
		print('\nМаршрутка рушила i тебе притиснуло заднiми дверима. Мiнус 2 грн за помнутий наплiчник.')
		bonus = bonus - 2
		print('\nТвiй баланс ', bonus, ' гривень.')
		
		act_2 = input('\nТи застрибнув через заднi дверi. Будеш передавати за проїзд? y/n >')
		
		if act_2 in act:
			print('\nТебе й так притиснуло, а ти ще платиш за проїзд! Мiнус 4 грн з гаманця')
			bonus = bonus - 4
			print('\nТвiй баланс ', bonus, ' гривень.')
		else:
			print('\nВодiй - хам, так йому й треба. Заощадив 4 грн.')
			bonus = bonus + 4
			print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nВiдразу пiд\'їхала порожня маршрутка i ти спокiйно сiв бiля вiкна. \nПлюс 5 грн за хороший настрiй')
		bonus = bonus + 5
		print('\nТвiй баланс ', bonus, ' гривень.')

	print ('------------------------------------------------------')		
		
	act_3 = input('\nНа наступнiй зупинцi напхалось купа людей. Звiльнити мiсце бабцi? y/n >')
	if act_3 in act:
		print ('\nЯ ж порядний пасажир. В подарунок отримав вiд бабцi бублик i 6 грн.')
		bonus = bonus + 6
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nОтримав вiд бабцi палицею. Зате сиджу!. \nМiнус 7 грн. за невихованiсть')
		bonus = bonus - 7
		print('\nТвiй баланс ', bonus, ' гривень.')
	
	print ('------------------------------------------------------')
	
	act_4 = input('\nБабця вийшла i мiсце знову вiльне. Можна присiсти. \nНа наступнiй зупинцi в маршрутку зайшла гарненька дiвчина. \nЗапропонувати їй сiсти на колiна? y/n >')
	if act_4 in act:
		print ('\nВдалий вибiр! Дiвчина ввiчливо погодилась. Може й на вечерю запросити. Плюс 10 грн в гаманець на квiти.')
		bonus = bonus + 10
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nЕх ти, таку дiвчину упустив. Вона так i стояла всю дорогу. Мiнус 5 грн за тупiсть.')
		bonus = bonus - 5
		print('\nТвiй баланс ', bonus, ' гривень.')

	print ('------------------------------------------------------')	
		
	act_5 = input('\nЖiночка кричить \"ДУЄ!!! Закрийте вiкно!\". Оце так бiда, закриєш вiкно? y/n >')
	if act_5 in act:
		print ('\nПолучаєш по руках вiд iншої жiночки, якiй душно. Мiнус 2 грн.')
		bonus = bonus - 2
		print('\nТвiй баланс ', bonus, ' гривень.')
	else:
		print('\nПолучаєш по руках вiд жiночки. Але люди тебе захищають. Плюс 6 грн в гаманець.')
		bonus = bonus + 6
		print('\nТвiй баланс ', bonus, ' гривень.')
		
	print ('------------------------------------------------------')
	
	if bonus > 0:
		print ('\nПоїздка добiгає кiнця, вже скоро кiнцева зупинка. \nНа районi друзi вже чекають з пивом. \nЗа день ти заробив ', bonus, 'гривень. Молодець!')
		act_7 = input('\nЗiграти iншим героєм? y/n >')
		if act_7 in act:
			print ('------------------------------------------------------')
			player = input('\nВибрати гравця: водiй - 1, пасажир - 2, бабця - 3 > ')
			if player == '1':
				Rider()
			elif player == '2':
				Passenger()	
			elif player == '3':
				print('Очiкуй незабаром')
				exit()	
	else:
		print('\nПоїздка добiгає кiнця, вже скоро кiнцева зупинка. \nНа районi друзi вже чекають з пивом. \nЗа день ти заробив ', bonus, 'гривень.') 
		act_8 = input('\nСпробувати заробити бiльше? y/n >')
		if act_8 in act:
			print ('------------------------------------------------------')
			Passenger()
		else:
			print ('------------------------------------------------------')
			player = input('\nВибрати гравця: водiй - 1, пасажир - 2, бабця - 3 > ')
			if player == '1':
				Rider()
			elif player == '2':
				Passenger()
			elif player == '3':
				print('Очiкуй незабаром')
				exit()
			
	
print ('------------------------------------------------------')
print ('------------------------------------------------------')
print ('----██████████████████████████████████████████████----')
print ('----█─███─█────█────█─███─█────█─█─█───█─██─█────█----')
print ('----█──█──█─██─█─██─█─███─█─██─█─█─██─██─█─██─██─█----')
print ('----█─█─█─█────█────█─█─█─█────█───██─██──███────█----')
print ('----█─███─█─██─█─████─█─█─█─██████─██─██─█─██─██─█----')
print ('----█─███─█─██─█─████─────█─████───██─██─██─█─██─█----')
print ('----██████████████████████████████████████████████----')
print ('------------------------------------------------------')
print ('------------------------------------------------------')

player = input('Вибрати гравця: водiй - 1, пасажир - 2, бабця - 3 > ')

print ('------------------------------------------------------')

if player == '1':
	Rider()
elif player == '2':
	Passenger()
elif player == '3':
	print('Очiкуй незабаром!')
	player = input('\nВибрати iншого гравця: водiй - 1, пасажир - 2 > ')
	if player == '1':
		Rider()
	elif player == '2':
		Passenger()